app/controllers/auths_controller.rb

  def index
    if params[:search]
      @auths = Auth.search(params[:search])
---
SELECT "auths".* FROM "auths" WHERE ( auth LIKE '%Рей Бредбері%' )

  def create
    @auth = Auth.new(auth_params)

    respond_to do |format|
      if @auth.save
---
INSERT INTO "auths" ("auth", "book", "biography", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["auth", "тест"], ["book", "тест"], ["biography", "тест"], ["created_at", 2017-05-10 20:14:41 UTC], ["updated_at", 2017-05-10 20:14:41 UTC]]

  def update
    respond_to do |format|
      if @auth.update(auth_params)
---
UPDATE "auths" SET "auth" = ?, "book" = ?, "updated_at" = ? WHERE "auths"."id" = ?  [["auth", "Рей Бредбері"], ["book", "451 за Фаренгейтом"], ["updated_at", 2017-05-02 20:24:14 UTC], ["id", 1]]

  def destroy
    @auth.destroy
---
DELETE FROM "auths" WHERE "auths"."id" = ?  [["id", 1]]

    def set_auth
      @auth = Auth.find(params[:id])
---
SELECT  "auths".* FROM "auths" WHERE "auths"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]