app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (title LIKE '%451 за Фаренгейтом%' OR auth LIKE '%451 за Фаренгейтом%' OR zhanr LIKE '%451 за Фаренгейтом%' OR description LIKE '%451 за Фаренгейтом%' )
SELECT  "books".* FROM "books" WHERE (title LIKE '%451 за Фаренгейтом%' OR auth LIKE '%451 за Фаренгейтом%' OR zhanr LIKE '%451 за Фаренгейтом%' OR description LIKE '%451 за Фаренгейтом%' ) ORDER BY title asc LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books" WHERE (title LIKE '%Фантастика%' OR auth LIKE '%Фантастика%' OR zhanr LIKE '%Фантастика%' OR description LIKE '%Фантастика%' )
---
  def index
    if params[:direction]
      session[:sort_by] = params[:direction]
    else
      session[:sort_by] = "title"
    end
    if params[:type_sort]
      session[:type_sort] = params[:type_sort]
    else
      session[:type_sort] = "asc"
    end
    if params[:search]
      books = Book.search(params[:search])
      books = books.order(sort_column + " " + sort_direction)
      @books = books.paginate(page: params[:page], per_page: 5)

SELECT "kritics".* FROM "kritics" WHERE ( title_book LIKE '%451 за Фаренгейтом%' )
SELECT "vidguks".* FROM "vidguks" WHERE ( title_book LIKE '%451 за Фаренгейтом%' )
---
  def show
    @kritics = Kritic.search(@book.title)
    @vidguks = Vidguk.search(@book.title)

INSERT INTO "books" ("title", "auth", "zhanr", "pages_qty", "description", "mini_description", "image_url", "url_to_book", "origin_url_to_book", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?
---
  def update
    respond_to do |format|
      if @book.update(book_params)

SELECT "books".* FROM "books" WHERE (title LIKE '%%' OR auth LIKE '%%' OR zhanr LIKE '%%' OR description LIKE '%%' )
---
    def find_book
      @book = Book.search(params[:search])