app/controllers/kritics_controller.rb

  def index
    if params[:search]
      @kritics = Kritic.search(params[:search])
---
SELECT "kritics".* FROM "kritics" WHERE ( title_book LIKE '%451 за Фаренгейтом%' )

  def create
    @kritic = Kritic.new(kritic_params)

    respond_to do |format|
      if @kritic.save
---
INSERT INTO "kritics" ("name", "title_book", "recensiya", "ocinka", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ddddd"], ["title_book", "dddd"], ["recensiya", "ssss"], ["ocinka", "ssss"], ["created_at", 2017-05-02 18:13:19 UTC], ["updated_at", 2017-05-02 18:13:19 UTC]]

  def update
    respond_to do |format|
      if @kritic.update(kritic_params)
---
UPDATE "kritics" SET "title_book" = ?, "ocinka" = ?, "updated_at" = ? WHERE "kritics"."id" = ?  [["title_book", "451 за Фаренгейтом"], ["ocinka", "5"], ["updated_at", 2017-05-02 20:23:19 UTC], ["id", 1]]

  def destroy
    @kritic.destroy
---
DELETE FROM "kritics" WHERE "kritics"."id" = ?  [["id", 4]]

    def set_kritic
      @kritic = Kritic.find(params[:id])
---
SELECT  "kritics".* FROM "kritics" WHERE "kritics"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]