app/controllers/userparams_controller.rb

  def create
 @userparam=current_user.build_userparam(user_params)

    if @userparam.save
---
INSERT INTO "userparams" ("firstname", "lastname", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "ttt"], ["lastname", "ttt"], ["city", "wire"], ["user_id", 1], ["created_at", 2017-05-05 21:57:39 UTC], ["updated_at", 2017-05-05 21:57:39 UTC]]
UPDATE "userparams" SET "user_id" = ?, "updated_at" = ? WHERE "userparams"."id" = ?  [["user_id", nil], ["updated_at", 2017-05-05 21:57:39 UTC], ["id", 1]]