app/controllers/vidguks_controller.rb

SELECT "vidguks".* FROM "vidguks" WHERE ( title_book LIKE '%451 за Фаренгейтом%' )
---
  def index
    if params[:search]
      @vidguks = Vidguk.search(params[:search])

INSERT INTO "vidguks" ("name", "title_book", "vidguk", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "gergrege"], ["title_book", "gere"], ["vidguk", "rgeerg"], ["date", "4234"], ["created_at", 2017-05-07 13:46:27 UTC], ["updated_at", 2017-05-07 13:46:27 UTC]]
---
  def create
    @vidguk = Vidguk.new(vidguk_params)

    respond_to do |format|
      if @vidguk.save

SELECT  "vidguks".* FROM "vidguks" WHERE "vidguks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_vidguk
      @vidguk = Vidguk.find(params[:id])