app/controllers/zhanrs_controller.rb

  def index
    @zhanrs = Zhanr.all
---
SELECT "zhanrs".* FROM "zhanrs"

  def create
    @zhanr = Zhanr.new(zhanr_params)

    respond_to do |format|
      if @zhanr.save
---
INSERT INTO "zhanrs" ("zhanr", "created_at", "updated_at") VALUES (?, ?, ?)  [["zhanr", "Фантастика"], ["created_at", 2017-05-02 19:49:04 UTC], ["updated_at", 2017-05-02 19:49:04 UTC]]

    def set_zhanr
      @zhanr = Zhanr.find(params[:id])
---
SELECT  "zhanrs".* FROM "zhanrs" WHERE "zhanrs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]